app/controllers/shipments_controller.rb

  def index
    @shipments = Shipment.all
---
SELECT "shipments".* FROM "shipments"

  def create
    @shipment = Shipment.new(shipment_params)

    respond_to do |format|
      if @shipment.save
---
INSERT INTO "shipments" ("code", "tracking", "date", "status", "carrier", "amount", "packages", "product", "weight", "length", "width", "height", "shipment", "note", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

    def set_shipment
      @shipment = Shipment.find(params[:id])
---
SELECT "shipments".* FROM "shipments" WHERE "shipments"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]